Revit 2024 API
Water Class
 A static class that provides access to the property names that appear in the Water visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Water
Visual Basic
Public NotInheritable Class Water
Visual C++
public ref class Water abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Water
See Also
Water Members
Autodesk.Revit.DB.Visual Namespace